; domain
(define (domain joint_bar)
(:requirements :strips :equality :typing :adl :conditional-effects)

(:types link angle)

(:predicates
	(AngleOrd ?a - angle ?a1 - angle)
	(HasAngle ?l - angle ?j - link)
	(Affected ?l1 - link ?l2 - link)
    (IsChildOf ?l1 - link ?l2 - link)
)

(:action increase_angle
:parameters (?child_link - link ?a1 ?a2 - angle)
:precondition (and 
	(HasAngle ?a1 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a1 ?child_link)) 
	    (HasAngle ?a2 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a3 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a3 ?ls))
			        (HasAngle ?a4 ?ls)
		        )
		    )
	    )
    )
)

(:action decrease_angle
:parameters (?child_link - link ?a2 ?a1 - angle)
:precondition (and 
	(HasAngle ?a2 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a2 ?child_link)) 
	    (HasAngle ?a1 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a4 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a4 ?ls))
			        (HasAngle ?a3 ?ls)
		        )
		    )
	    )
    )
)
)

; problem
(define (problem joint_bar_5)
(:domain joint_bar)
(:objects
    link1 link2 link3 link4 link5 link6 link7 link8 link9 - link
    angle0 angle20 angle40 angle60 angle80 angle100 angle120 angle140 angle160 angle180 angle200 angle220 angle240 angle260 angle280 angle300 angle320 angle340 - angle)
(:init
    (AngleOrd angle0 angle20)
    (AngleOrd angle20 angle40)
    (AngleOrd angle40 angle60)
    (AngleOrd angle60 angle80)
    (AngleOrd angle80 angle100)
    (AngleOrd angle100 angle120)
    (AngleOrd angle120 angle140)
    (AngleOrd angle140 angle160)
    (AngleOrd angle160 angle180)
    (AngleOrd angle180 angle200)
    (AngleOrd angle200 angle220)
    (AngleOrd angle220 angle240)
    (AngleOrd angle240 angle260)
    (AngleOrd angle260 angle280)
    (AngleOrd angle280 angle300)
    (AngleOrd angle300 angle320)
    (AngleOrd angle320 angle340)
    (AngleOrd angle340 angle0)

    (IsChildOf link2 link1)
    (IsChildOf link3 link2)
    (IsChildOf link4 link3)
    (IsChildOf link5 link4)
    (IsChildOf link6 link5)
    (IsChildOf link7 link6)
    (IsChildOf link8 link7)
    (IsChildOf link9 link8)

    (Affected link2 link1)
    (Affected link3 link1)
    (Affected link3 link2)
    (Affected link4 link1)
    (Affected link4 link2)
    (Affected link4 link3)
    (Affected link5 link1)
    (Affected link5 link2)
    (Affected link5 link3)
    (Affected link5 link4)
    (Affected link6 link1)
    (Affected link6 link2)
    (Affected link6 link3)
    (Affected link6 link4)
    (Affected link6 link5)
    (Affected link7 link1)
    (Affected link7 link2)
    (Affected link7 link3)
    (Affected link7 link4)
    (Affected link7 link5)
    (Affected link7 link6)
    (Affected link8 link1)
    (Affected link8 link2)
    (Affected link8 link3)
    (Affected link8 link4)
    (Affected link8 link5)
    (Affected link8 link6)
    (Affected link8 link7)
    (Affected link9 link1)
    (Affected link9 link2)
    (Affected link9 link3)
    (Affected link9 link4)
    (Affected link9 link5)
    (Affected link9 link6)
    (Affected link9 link7)
    (Affected link9 link8)

    (HasAngle angle40 link1)
    (HasAngle angle180 link2)
    (HasAngle angle280 link3)
    (HasAngle angle140 link4)
    (HasAngle angle340 link5)
    (HasAngle angle260 link6)
    (HasAngle angle340 link7)
    (HasAngle angle40 link8)
    (HasAngle angle20 link9)
)
(:goal
(and
    (HasAngle angle100 link1)
    (HasAngle angle100 link2)
    (HasAngle angle120 link3)
    (HasAngle angle340 link4)
    (HasAngle angle240 link5)
    (HasAngle angle260 link6)
    (HasAngle angle240 link7)
    (HasAngle angle300 link8)
    (HasAngle angle240 link9)
    )
)
)

; plan
1. (increase_angle link1 angle40 angle60)
   deleted: (hasangle angle40 link1) (hasangle angle180 link2) (hasangle angle280 link3) (hasangle angle140 link4) (hasangle angle340 link5) (hasangle angle260 link6) (hasangle angle340 link7) (hasangle angle40 link8) (hasangle angle20 link9)
   added: (hasangle angle60 link1) (hasangle angle200 link2) (hasangle angle300 link3) (hasangle angle160 link4) (hasangle angle0 link5) (hasangle angle280 link6) (hasangle angle0 link7) (hasangle angle60 link8) (hasangle angle40 link9)
   goals met: 0 of 9
2. (increase_angle link1 angle60 angle80)
   deleted: (hasangle angle60 link1) (hasangle angle200 link2) (hasangle angle300 link3) (hasangle angle160 link4) (hasangle angle0 link5) (hasangle angle280 link6) (hasangle angle0 link7) (hasangle angle60 link8) (hasangle angle40 link9)
   added: (hasangle angle80 link1) (hasangle angle220 link2) (hasangle angle320 link3) (hasangle angle180 link4) (hasangle angle20 link5) (hasangle angle300 link6) (hasangle angle20 link7) (hasangle angle80 link8) (hasangle angle60 link9)
   goals met: 0 of 9
3. (increase_angle link1 angle80 angle100)
   deleted: (hasangle angle80 link1) (hasangle angle220 link2) (hasangle angle320 link3) (hasangle angle180 link4) (hasangle angle20 link5) (hasangle angle300 link6) (hasangle angle20 link7) (hasangle angle80 link8) (hasangle angle60 link9)
   added: (hasangle angle100 link1) (hasangle angle240 link2) (hasangle angle340 link3) (hasangle angle200 link4) (hasangle angle40 link5) (hasangle angle320 link6) (hasangle angle40 link7) (hasangle angle100 link8) (hasangle angle80 link9)
   goals met: 1 of 9
4. (decrease_angle link2 angle240 angle220)
   deleted: (hasangle angle240 link2) (hasangle angle340 link3) (hasangle angle200 link4) (hasangle angle40 link5) (hasangle angle320 link6) (hasangle angle40 link7) (hasangle angle100 link8) (hasangle angle80 link9)
   added: (hasangle angle220 link2) (hasangle angle320 link3) (hasangle angle180 link4) (hasangle angle20 link5) (hasangle angle300 link6) (hasangle angle20 link7) (hasangle angle80 link8) (hasangle angle60 link9)
   goals met: 1 of 9
5. (decrease_angle link2 angle220 angle200)
   deleted: (hasangle angle220 link2) (hasangle angle320 link3) (hasangle angle180 link4) (hasangle angle20 link5) (hasangle angle300 link6) (hasangle angle20 link7) (hasangle angle80 link8) (hasangle angle60 link9)
   added: (hasangle angle200 link2) (hasangle angle300 link3) (hasangle angle160 link4) (hasangle angle0 link5) (hasangle angle280 link6) (hasangle angle0 link7) (hasangle angle60 link8) (hasangle angle40 link9)
   goals met: 1 of 9
6. (decrease_angle link2 angle200 angle180)
   deleted: (hasangle angle200 link2) (hasangle angle300 link3) (hasangle angle160 link4) (hasangle angle0 link5) (hasangle angle280 link6) (hasangle angle0 link7) (hasangle angle60 link8) (hasangle angle40 link9)
   added: (hasangle angle180 link2) (hasangle angle280 link3) (hasangle angle140 link4) (hasangle angle340 link5) (hasangle angle260 link6) (hasangle angle340 link7) (hasangle angle40 link8) (hasangle angle20 link9)
   goals met: 2 of 9
7. (decrease_angle link2 angle180 angle160)
   deleted: (hasangle angle180 link2) (hasangle angle280 link3) (hasangle angle140 link4) (hasangle angle340 link5) (hasangle angle260 link6) (hasangle angle340 link7) (hasangle angle40 link8) (hasangle angle20 link9)
   added: (hasangle angle160 link2) (hasangle angle260 link3) (hasangle angle120 link4) (hasangle angle320 link5) (hasangle angle240 link6) (hasangle angle320 link7) (hasangle angle20 link8) (hasangle angle0 link9)
   goals met: 1 of 9
8. (decrease_angle link2 angle160 angle140)
   deleted: (hasangle angle160 link2) (hasangle angle260 link3) (hasangle angle120 link4) (hasangle angle320 link5) (hasangle angle240 link6) (hasangle angle320 link7) (hasangle angle20 link8) (hasangle angle0 link9)
   added: (hasangle angle140 link2) (hasangle angle240 link3) (hasangle angle100 link4) (hasangle angle300 link5) (hasangle angle220 link6) (hasangle angle300 link7) (hasangle angle0 link8) (hasangle angle340 link9)
   goals met: 1 of 9
9. (decrease_angle link2 angle140 angle120)
   deleted: (hasangle angle140 link2) (hasangle angle240 link3) (hasangle angle100 link4) (hasangle angle300 link5) (hasangle angle220 link6) (hasangle angle300 link7) (hasangle angle0 link8) (hasangle angle340 link9)
   added: (hasangle angle120 link2) (hasangle angle220 link3) (hasangle angle80 link4) (hasangle angle280 link5) (hasangle angle200 link6) (hasangle angle280 link7) (hasangle angle340 link8) (hasangle angle320 link9)
   goals met: 1 of 9
10. (decrease_angle link2 angle120 angle100)
   deleted: (hasangle angle120 link2) (hasangle angle220 link3) (hasangle angle80 link4) (hasangle angle280 link5) (hasangle angle200 link6) (hasangle angle280 link7) (hasangle angle340 link8) (hasangle angle320 link9)
   added: (hasangle angle100 link2) (hasangle angle200 link3) (hasangle angle60 link4) (hasangle angle260 link5) (hasangle angle180 link6) (hasangle angle260 link7) (hasangle angle320 link8) (hasangle angle300 link9)
   goals met: 2 of 9
11. (decrease_angle link3 angle200 angle180)
   deleted: (hasangle angle200 link3) (hasangle angle60 link4) (hasangle angle260 link5) (hasangle angle180 link6) (hasangle angle260 link7) (hasangle angle320 link8) (hasangle angle300 link9)
   added: (hasangle angle180 link3) (hasangle angle40 link4) (hasangle angle240 link5) (hasangle angle160 link6) (hasangle angle240 link7) (hasangle angle300 link8) (hasangle angle280 link9)
   goals met: 5 of 9
12. (decrease_angle link3 angle180 angle160)
   deleted: (hasangle angle180 link3) (hasangle angle40 link4) (hasangle angle240 link5) (hasangle angle160 link6) (hasangle angle240 link7) (hasangle angle300 link8) (hasangle angle280 link9)
   added: (hasangle angle160 link3) (hasangle angle20 link4) (hasangle angle220 link5) (hasangle angle140 link6) (hasangle angle220 link7) (hasangle angle280 link8) (hasangle angle260 link9)
   goals met: 2 of 9
13. (decrease_angle link3 angle160 angle140)
   deleted: (hasangle angle160 link3) (hasangle angle20 link4) (hasangle angle220 link5) (hasangle angle140 link6) (hasangle angle220 link7) (hasangle angle280 link8) (hasangle angle260 link9)
   added: (hasangle angle140 link3) (hasangle angle0 link4) (hasangle angle200 link5) (hasangle angle120 link6) (hasangle angle200 link7) (hasangle angle260 link8) (hasangle angle240 link9)
   goals met: 3 of 9
14. (decrease_angle link3 angle140 angle120)
   deleted: (hasangle angle140 link3) (hasangle angle0 link4) (hasangle angle200 link5) (hasangle angle120 link6) (hasangle angle200 link7) (hasangle angle260 link8) (hasangle angle240 link9)
   added: (hasangle angle120 link3) (hasangle angle340 link4) (hasangle angle180 link5) (hasangle angle100 link6) (hasangle angle180 link7) (hasangle angle240 link8) (hasangle angle220 link9)
   goals met: 4 of 9
15. (increase_angle link5 angle180 angle200)
   deleted: (hasangle angle180 link5) (hasangle angle100 link6) (hasangle angle180 link7) (hasangle angle240 link8) (hasangle angle220 link9)
   added: (hasangle angle200 link5) (hasangle angle120 link6) (hasangle angle200 link7) (hasangle angle260 link8) (hasangle angle240 link9)
   goals met: 5 of 9
16. (decrease_angle link8 angle260 angle240)
   deleted: (hasangle angle260 link8) (hasangle angle240 link9)
   added: (hasangle angle240 link8) (hasangle angle220 link9)
   goals met: 4 of 9
17. (increase_angle link6 angle120 angle140)
   deleted: (hasangle angle120 link6) (hasangle angle200 link7) (hasangle angle240 link8) (hasangle angle220 link9)
   added: (hasangle angle140 link6) (hasangle angle220 link7) (hasangle angle260 link8) (hasangle angle240 link9)
   goals met: 5 of 9
18. (increase_angle link6 angle140 angle160)
   deleted: (hasangle angle140 link6) (hasangle angle220 link7) (hasangle angle260 link8) (hasangle angle240 link9)
   added: (hasangle angle160 link6) (hasangle angle240 link7) (hasangle angle280 link8) (hasangle angle260 link9)
   goals met: 5 of 9
19. (decrease_angle link8 angle280 angle260)
   deleted: (hasangle angle280 link8) (hasangle angle260 link9)
   added: (hasangle angle260 link8) (hasangle angle240 link9)
   goals met: 6 of 9
20. (increase_angle link6 angle160 angle180)
   deleted: (hasangle angle160 link6) (hasangle angle240 link7) (hasangle angle260 link8) (hasangle angle240 link9)
   added: (hasangle angle180 link6) (hasangle angle260 link7) (hasangle angle280 link8) (hasangle angle260 link9)
   goals met: 4 of 9
21. (decrease_angle link7 angle260 angle240)
   deleted: (hasangle angle260 link7) (hasangle angle280 link8) (hasangle angle260 link9)
   added: (hasangle angle240 link7) (hasangle angle260 link8) (hasangle angle240 link9)
   goals met: 6 of 9
22. (increase_angle link5 angle200 angle220)
   deleted: (hasangle angle200 link5) (hasangle angle180 link6) (hasangle angle240 link7) (hasangle angle260 link8) (hasangle angle240 link9)
   added: (hasangle angle220 link5) (hasangle angle200 link6) (hasangle angle260 link7) (hasangle angle280 link8) (hasangle angle260 link9)
   goals met: 4 of 9
23. (decrease_angle link7 angle260 angle240)
   deleted: (hasangle angle260 link7) (hasangle angle280 link8) (hasangle angle260 link9)
   added: (hasangle angle240 link7) (hasangle angle260 link8) (hasangle angle240 link9)
   goals met: 6 of 9
24. (decrease_angle link7 angle240 angle220)
   deleted: (hasangle angle240 link7) (hasangle angle260 link8) (hasangle angle240 link9)
   added: (hasangle angle220 link7) (hasangle angle240 link8) (hasangle angle220 link9)
   goals met: 4 of 9
25. (increase_angle link6 angle200 angle220)
   deleted: (hasangle angle200 link6) (hasangle angle220 link7) (hasangle angle240 link8) (hasangle angle220 link9)
   added: (hasangle angle220 link6) (hasangle angle240 link7) (hasangle angle260 link8) (hasangle angle240 link9)
   goals met: 6 of 9
26. (increase_angle link2 angle100 angle120)
   deleted: (hasangle angle100 link2) (hasangle angle120 link3) (hasangle angle340 link4) (hasangle angle220 link5) (hasangle angle220 link6) (hasangle angle240 link7) (hasangle angle260 link8) (hasangle angle240 link9)
   added: (hasangle angle120 link2) (hasangle angle140 link3) (hasangle angle0 link4) (hasangle angle240 link5) (hasangle angle240 link6) (hasangle angle260 link7) (hasangle angle280 link8) (hasangle angle260 link9)
   goals met: 2 of 9
27. (increase_angle link6 angle240 angle260)
   deleted: (hasangle angle240 link6) (hasangle angle260 link7) (hasangle angle280 link8) (hasangle angle260 link9)
   added: (hasangle angle260 link6) (hasangle angle280 link7) (hasangle angle300 link8) (hasangle angle280 link9)
   goals met: 4 of 9
28. (decrease_angle link7 angle280 angle260)
   deleted: (hasangle angle280 link7) (hasangle angle300 link8) (hasangle angle280 link9)
   added: (hasangle angle260 link7) (hasangle angle280 link8) (hasangle angle260 link9)
   goals met: 3 of 9
29. (increase_angle link8 angle280 angle300)
   deleted: (hasangle angle280 link8) (hasangle angle260 link9)
   added: (hasangle angle300 link8) (hasangle angle280 link9)
   goals met: 4 of 9
30. (decrease_angle link2 angle120 angle100)
   deleted: (hasangle angle120 link2) (hasangle angle140 link3) (hasangle angle0 link4) (hasangle angle240 link5) (hasangle angle260 link6) (hasangle angle260 link7) (hasangle angle300 link8) (hasangle angle280 link9)
   added: (hasangle angle100 link2) (hasangle angle120 link3) (hasangle angle340 link4) (hasangle angle220 link5) (hasangle angle240 link6) (hasangle angle240 link7) (hasangle angle280 link8) (hasangle angle260 link9)
   goals met: 5 of 9
31. (increase_angle link5 angle220 angle240)
   deleted: (hasangle angle220 link5) (hasangle angle240 link6) (hasangle angle240 link7) (hasangle angle280 link8) (hasangle angle260 link9)
   added: (hasangle angle240 link5) (hasangle angle260 link6) (hasangle angle260 link7) (hasangle angle300 link8) (hasangle angle280 link9)
   goals met: 7 of 9
32. (decrease_angle link7 angle260 angle240)
   deleted: (hasangle angle260 link7) (hasangle angle300 link8) (hasangle angle280 link9)
   added: (hasangle angle240 link7) (hasangle angle280 link8) (hasangle angle260 link9)
   goals met: 7 of 9
33. (increase_angle link8 angle280 angle300)
   deleted: (hasangle angle280 link8) (hasangle angle260 link9)
   added: (hasangle angle300 link8) (hasangle angle280 link9)
   goals met: 8 of 9
34. (decrease_angle link9 angle280 angle260)
   deleted: (hasangle angle280 link9)
   added: (hasangle angle260 link9)
   goals met: 8 of 9
35. (decrease_angle link9 angle260 angle240)
   deleted: (hasangle angle260 link9)
   added: (hasangle angle240 link9)
   goals met: 9 of 9
